#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "RUS");

	printf("123\n");

	puts("------------------------");

	printf("1\n2\n3\n\n");

	puts("------------------------");

	printf("1\n\t 2\n\t\t 3\n");

	puts("------------------------");

	printf("%d\n\t %d\n\t\t\ %d\n\t\t\t %d\n", 1, 2, 3, 4);

	puts("------------------------");

	printf("%10.3f\n", 12.234567);

	puts("------------------------");

	printf("%10.5f\n", 12.234567);

	puts("------------------------");

	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);

	puts("------------------------");

	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);

	puts("------------------------");

	printf("Произведение %d на %d равно %d\n", 2000, 4, 2000*4);

	puts("------------------------");

	printf("%g разделить %e равно %f\n", 5.,2000000.,5./2000000);
	printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000);
	printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
	printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
	printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);

}